mlsorensen/Apollo2/src/device/main.cpp
    // Task-stack census, every 5th heap line. Stacks are INTERNAL RAM and they
    // are the recoverable kind of waste: of the seven tasks this firmware
    // creates, only loop and updchk were ever measured, and BOTH sit ~50%
    // unused (loop 9476 of 16384; updchk ~4400 of 8192) -- 10.7KB dead in the
    // two we could see. The other five (micra_link/scale_link/shot_store 8192
    // each, rgb_resync 4096, snd_play 3584) are 32KB of pure guesswork.
    // uxTaskGetSystemState needs no per-task plumbing and the trace facility is
    // already enabled; the array is static so the census itself allocates
    // nothing from the pool it is reporting on.
    static uint8_t census_tick = 0;
    if (++census_tick >= 5) {
      census_tick = 0;
      static TaskStatus_t tasks[24];
      const UBaseType_t n = uxTaskGetSystemState(tasks, 24, nullptr);
      char line[420];
      int len = std::snprintf(line, sizeof(line), "stacks(spare):");
      for (UBaseType_t i = 0; i < n && len > 0 && len < (int)sizeof(line) - 24; ++i) {
        len += std::snprintf(line + len, sizeof(line) - len, " %s=%u",
                             tasks[i].pcTaskName,
                             static_cast<unsigned>(
                                 uxTaskGetStackHighWaterMark(tasks[i].xHandle)));
      }
      core::logf("%s\n", line);
    }
  }

  // Hourly last-known-time snapshot -> NVS, so the next boot without a
  // surviving RTC starts approximately right instead of at 1970.
  static uint32_t last_time_save_ms = 0;
  if (millis() - last_time_save_ms >= 3600u * 1000u) {
    last_time_save_ms = millis();
    const std::time_t now_unix = g_clock.now_unix();
    if (now_unix != 0) g_config.set_last_unix(now_unix);
  }
  g_network.poll();          // drive the WiFi station state machine + NTP->RTC

  // Park BLE reconnect scanning while the machine is idle (screensaver on): it
  // stops the pointless "connect failed" churn when nobody's using the machine
  // AND frees the ~40 KB of internal RAM the radio's scanning holds — which is
  // what lets the daily update check (fired only while idle, above) run reliably
  // on the heap-tight S3. Only NEW (re)connect attempts are suppressed; an
  // already-established Micra/scale link stays connected. Resumes on wake.
  {
    static bool saver_prev = false;
    const bool saver = g_app.screensaver_active();
    if (saver != saver_prev) {
      saver_prev = saver;
      g_micra.pause_connects(saver);
      g_scale.pause_connects(saver);
    }
  }

  // Update check (notify-only): the App requests a check — automatically once
  // per boot when "check at startup" is on, or from the Info button — and the
  // App watches check_seq() for the result. We just spawn the live fetch task
  // when a request is pending and the network's genuinely up (station + NTP,
  // proof the internet's reachable); it no-ops without WiFi. TLS runs against
  // PSRAM so it coexists with the BLE links (see update_check.cpp). Never start
  // one mid-shot — the radio and heap are busy and a notice would interrupt.
  {
    // Automatic boot check: fire once the network's ready, and RETRY a few
    // times if it can't reach the server — DNS often isn't resolvable for a
    // second or two right after WiFi associates, and a single miss would
    // silently skip the boot notice for the whole session. Retries stop as soon
    // as one check reaches the server (last_check_ok), or after a few tries.
    static int boot_tries = 0;
    static bool boot_done = false;
    static uint32_t next_boot_try_ms = 0;
    // Bound the boot check to ~1 min of uptime so its retries never spill into
    // normal use (a slow NTP delays the start; cap it regardless — the daily
    // idle check and a manual check cover a machine whose NTP wasn't ready yet).
    if (!boot_done && millis() > 60000) boot_done = true;
    if (!boot_done && g_update_check.check_cadence() >= 1 &&
        g_update_check.network_ready() && !g_update_check.task_active() &&
        !core::shot_in_flight(g_brew.snapshot()) && millis() >= next_boot_try_ms) {
      if (boot_tries > 0 && g_update_check.last_check_ok()) {
        boot_done = true;  // a check reached the server; nothing more to do
      } else if (boot_tries >= 5) {
        boot_done = true;
        core::logf("UpdateCheck: boot check unreachable after retries\n");
      } else {
        core::logf("UpdateCheck: automatic check at boot (try %d)\n", ++boot_tries);
        g_update_check.begin_check();
        next_boot_try_ms = millis() + 6000;  // space retries while DNS settles
      }
    }
    // Repeating cadences: Daily (mode 2) and Hourly (mode 3). Both fire ONLY
    // while idle (the screensaver is on). BLE reconnect scanning is parked
    // during the saver (see below), so the check runs with internal RAM freed —
    // reliable, and never during active use. If the saver is disabled neither
    // fires; boot + manual still cover it.
    static uint32_t last_repeat_ms = 0;
    const int cadence = g_update_check.check_cadence();
    const uint32_t repeat_ms = cadence == 3   ? 60u * 60u * 1000u
                               : cadence == 2 ? 24u * 60u * 60u * 1000u
                                              : 0;
    if (repeat_ms != 0 && boot_done && g_app.screensaver_active() &&
        g_update_check.network_ready() && !g_update_check.task_active() &&
        !core::shot_in_flight(g_brew.snapshot()) &&
        millis() - last_repeat_ms >= repeat_ms) {
      last_repeat_ms = millis();
      core::logf("UpdateCheck: %s automatic check\n",
                 cadence == 3 ? "hourly" : "daily");
      g_update_check.begin_check();
    }
    // Consume the request LAST: if the network isn't ready yet (NTP still
    // syncing) or a shot's running, leave it pending so the check fires as soon
    // as it can — a manual check's "Checking..." spinner then resolves on its
    // own instead of hanging on a swallowed request.
    const bool shot_busy = core::shot_in_flight(g_brew.snapshot());
    if (g_update_check.network_ready() && !g_update_check.task_active() &&
        !shot_busy && g_update_check.take_check_request()) {
      core::logf("UpdateCheck: live check\n");
      g_update_check.begin_check();
    }
  }

  // First-boot health confirm for an OTA-installed image: the bootloader
  // boots it PENDING_VERIFY (verifyRollbackLater below defers the automatic
  // confirm), and a build that crashes/bootloops before this point is rolled
  // back automatically. Surviving 60 s of normal loop() = healthy.
  {
    static bool ota_checked = false;
    if (!ota_checked && millis() > 60000) {
      ota_checked = true;
      const esp_partition_t* run = esp_ota_get_running_partition();
      esp_ota_img_states_t st;
      if (esp_ota_get_state_partition(run, &st) == ESP_OK &&
          st == ESP_OTA_IMG_PENDING_VERIFY) {
        esp_ota_mark_app_valid_cancel_rollback();
        core::logf("OTA: new image confirmed healthy (rollback canceled)\n");
      }
    }
  }

  // Reflect the latest cached machine state in the UI (cheap; no BLE here).
  // NOTE this path re-sets many Home widgets — everything it touches must go
  // through the ui::set_* change-detecting setters (widgets.h): LVGL setters
  // invalidate even for identical values, and the resulting no-op churn
  // doubled every ~500ms render pass on the S3 (visible scroll stutter).
  static uint32_t last = 0;
  if (millis() - last > kUiRefreshMs) {
    last = millis();
    g_app.refresh();
  }

  // Sample temps into the history ring for the Stats charts (connected only).
  static uint32_t last_sample = 0;
  if (millis() - last_sample > kSampleMs) {
    last_sample = millis();
    const core::MachineSnapshot snap = g_micra.snapshot();
    if (snap.link == core::Link::Connected) {
      g_history.add(snap.brew_temp_c, snap.boiler_temp_c);
    }
  }

  // 1ms (was 5): under load the loop runs exactly once per LVGL frame, so the
  // whole delay lands on every frame's cadence — profiled at ~5ms/frame of
  // pure idle on the 5". 1ms still yields to lower-priority tasks.
  delay(1);
}
